# 'brew tap'
tap "homebrew/cask"
tap "buo/cask-upgrade"
# set arguments for all 'brew install --cask' commands
cask_args appdir: "~/Applications" # , require_sha: true # Require_sha is causing google, amazon, miro to fail

# Install productivity helpers
cask "rectangle"       # Move windows around with keys
cask "alt-tab"         # Windows like tab
cask "alfred"          # Additional search and much more
cask "pock"            # Touchbar config
cask "cheatsheet"      # Show shotcuts on screen
# cask  customssshortcut # Define own shortcuts in Apps

# Install basic tools
cask "iterm2"
cask "macvim"
cask "google-chrome"
cask "amazon-photos"
cask "messenger"
cask "miro"
cask "zoom"
cask "gimp"

# Install basic tools for improved terminal
brew "git"
brew "wget"
brew "bat"                 # Improved cat
brew "exa"                 # Improved ls
brew "tree"
brew "tldr"                # Improved man
brew "jq"                  # Commandline JSON processor
brew "htop"                # Improved top
brew "jdupes"              # Duplicate file finder
brew "fzf"                 # Fuzzy finder
brew "fasd"                # Quick access to (recent) files and directories
brew "ripgrep"             # Improved grep
brew "tmux"                # Improvee screen
brew "wakeonlan"
brew "nmap"               # Network scanner
brew "ranger"             # Vi like file browser
brew "mas"                # Install from Appstore via Terrminal)
brew "speedtest-cli"    # Network speed test
brew "terminal-notifier" # Notify via notification center
brew "ffmpeg"
brew "exiftool"
brew "gnumeric" # Command line calculations

# Install quick look plugins
cask "qlcolorcode"
cask "qlstephen"
cask "qlmarkdown"
cask "qlimagesize"
cask "qlvideo"
cask "quicklook-json"
cask "qlprettypatch"
cask "quicklook-csv"
cask "suspicious-package"
cask "betterzip"
cask "webpquicklook"
cask "apparency"

# Install additional tools
cask "raycast" # Productivity launchbar
cask "appcleaner"
cask "brave-browser"
cask "caffeine"  # Dont let mac sleep
cask "android-file-transfer"
cask "anydo"
cask "spotify"
cask "spotmenu" # Spotify menu
cask "vlc" # 
cask "iina" # Modern video player 
cask "gemini" #duplicate finder 
cask "geotag" # Edit geodata of pictures
cask "notion" # Notes taking
cask 1password-cli
cask "hiddenbar" # Hide icons in topbar
cask "spacelauncher" # App launcher with Space key
cask "dropzone" # Productivity drag/drop
cask "stats" # Productivity system status
cask "webex" # Video communication and virtual meeting platform
cask "imagemagick" # Command line image editing
cask "pigz" # parallel gzip (add alias)
cask "sublime" # More efficient text editor, but not vim

# Apps from Appstore
mas "HomeAtmo : Der Netatmo client", id: 1359795390  # HomeAtmo Lite
# mas "HomeAtmo Lite : Der Netatmo client", id: 1437630108  # HomeAtmo Lite
mas "Quick Calendar", id: 1004514425   # QuickCal for widget in notification center
mas "Brother P-touch Editor", id: 1453365242  # Brothere P Touch
mas "We Love Lights für Philips Hue", id: 1479422551  # Brothere P Touch
# mas "Hue in the Menu", id: 1534707384  # Hue App or we love lights
mas "JustStream", id: 1474804779  # Juststream for file to Chromecast streaming
mas "Meeter for Zoom, Teams & Co", id: 1510445899   # Meeter to join meetings from menubar
mas "Memory Diag", id: 748212890 # Memory diag widget

# TODO
# cask monitorcontrol vs betterdisplay # External monitor control
# cask "sweet-home32" # Interior design and plan
# cask foremost/testdisk/fd recovery # Data recovery tool
