# 'brew tap'
tap "buo/cask-upgrade"
tap "anomalyco/tap"
# set arguments for all 'brew install --cask' commands
cask_args appdir: "~/Applications" # , require_sha: true # Require_sha is causing google, amazon, miro to fail

# Install UI basic tools
cask "iterm2"          # Improved terminal
cask "arc"             # Arc Browser, Chromium based, with good UI and privacy focus
cask "synology-drive"  # 2-direction sync with NAS
cask "raycast"         # Productivity launchbar
brew "mas"             # Install from Appstore via Terminal
cask "spacelauncher"   # App launcher with Space key

# Install basic tools for improved terminal
brew "tmux"                # Improved screen
brew "git"
brew "neovim"              # Install neovim
brew "git-delta"           # Syntax highlighting for lazygit
brew "lazygit"             # Terminal UI for git 
brew "tldr"                # Improved man
brew "wget"
brew "terminal-notifier"   # Notify via notification center

# Search helpers
brew "fzf"                 # Fuzzy finder (general purpose)
brew "fasd"                # Quick access to (recent) files and directories
brew "zoxide"              # Same as fasd but Rust, no file history. For yazi.
brew "fd"                  # Easy find
brew "ripgrep"             # Improved grep
brew "ddgr"                # DuckDuckGo search from terminal
brew "w3m"                 # Terminal web browser (for reading search results)
brew "knqyf263/pet/pet"    # CLI snippet manager
brew "gawk"                # Needed by some installers

# AI tools
cask "claude-code"    # Claude code
brew "anomalyco/tap/opencode" # Opencode repo for faster updates
brew "ollama"         # Run LLMs locally
# cask "lm-studio"    # GUI for running local LLMs

# Filesystem
brew "bat"                 # Improved cat
brew "eza"                 # Improved ls, exa is not maintained anymore
brew "lsd"                 # Improved ls
brew "dust"                # Fast file/directory space utilization
brew "duf"                 # Disk space utilization
brew "yazi"                # Lighting fast file manager written in Rust
brew "fclones"             # The fastests file dupplicate finder
brew "up"                  # Command for writing and testing pipelines
brew "tree"                # Show directory structure as tree
brew "termscp"             # Terminal scp client
brew "age"                 # File encryption
#brew "hdparm"              # HDD performance
#brew "f3"                  # Testing SD cards (f3write/f3read)
#brew "thefuck"             # Correction of misstyped commands
#brew "midnight-commander"  # Midnight comander
#brew "nnn"                 # Lighting fast file manager
#brew "broot"               # Interactive file manager & search, incl. infile search
#TODO vimv - vim style mass renamer of files
#TODO brew "pigz"         # Parallel gzip (add alias) / Not used daily
#TODO cask foremost/testdisk recovery # Data recovery tool

# Network & performance
brew "wakeonlan"           # Wake on lan
brew "bandwhich"           # Network utilization by process
brew "iperf"               # Measure max TCP/UDP bandwidth
brew "iperf3"              # Measure max TCP/UDP bandwidth
brew "nmap"                # Network scanner
brew "speedtest-cli"       # Network speed test
brew "gping"               # Plot ping in terminal
brew "httpie"              # Human friendly HTTP client for API era
brew "doggo"               # Command-line DNS Client for Humans

# System status
brew "fastfetch"           # System information at login (neofetch is slow)
brew "btop"                # Much cooler top
brew "zenith"              # Like btop but in Rust
brew "hyperfine"           # Process performance measurement
brew "pstree"              # Show running processes as tree (pstree -p to show pids)
brew "procs"               # Service monitoring system and time series database
cask "stats"               # Productivity system status
#brew "htop"                # Improved top
#brew "bottom"              # System activity monitoring, memory, network, PCU, temp (btm)
#brew "glances"             # Holistic system monitoring

# Multimedia editing
#cask "imagemagick" # Command line image manipulation
brew "exiftool"       # Read and write meta information in files, e.g.  exiftool -all= file.jpg to remove all metadata
brew "ffmpeg"         # Multimedia framework for processing of multimedia files
brew "exiv2"          # EXIF and IPTC metadata manipulation tool / Used by fclones
cask "geotag"         # Edit geodata of pictures
brew "viu"            # Picture viewer within iTerm
brew "mcat"           # Multimedia cat
cask "vlc" # Multimedia player
cask "iina" # Modern video player 
cask "gimp" # Image manipulation
cask "phoenix-slides" # Handy picture viewer with metadata info on screen

# Markdown, PDF, LaTeX
brew "pandoc"         # Universal document converter, e.g. markdown to pdf just with 'pandoc file.md -o file.pdf'
brew "pdfgrep"        # Grep pdf files
brew "poppler"        # Pdf to text
#brew "mactex"        # LaTeX distribution for MacOS
brew "tectonic"       # LaTeX engine that is easy to install and use, alternative to mactex

# Data editing
brew "nushell"     # Shell for structural/table-based data editing and pipes
brew "saulpw/vd/visidata"  # Install saulpw/vd/visidata # Editing spreadsheets in Terminal
brew "jq"          # Commandline JSON processor
#brew "jless"       # JSON command line viewer
brew "fx"          # JSON viewer
brew "datamash"    # Commandline data analysis
brew "csvkit"      # Command line csv processing
brew "choose"      # Human friendly cut
brew "peco"        # For interactive file filtering (like br and print selected line)
#brew "lnav"        # Log browsing / log navigator
brew "glow"        # Colourful rendering of markdown files
#brew "miller"     # For csv formatting
brew "dateutils"   # Date operations, compute differences between dates (includes datediff command)

# Development tools
brew "entr"        # File monitoring and auto execution
brew "uv"          # Python project management
brew "just"        # Better make to save project commands
brew "universal-ctags"     # ctags parser for tags in Vim
brew "direnv"      # Per-directory environment variables
brew "stow"        # Symlink manager for dotfiles


# Quick Look Plugins
cask "syntax-highlight"  # Quick Look plug-in that renders source code with syntax highlighting
cask "qlmarkdown"    # Quick Look plugin for CommonMark and Markdown (!must be started once)
cask "qlvideo"         # Thumbnails, static previews, cover art and metadata for video files
# cask "qlcolorcode"     # Quick Look plug-in that renders source code with syntax highlighting
# cask "qlstephen"       # Quick Look plugin for plaintext files without an extension
# cask "quicklook-json"  # Quick Look plugin to view json files / Solved by # syntax-highlight
# cask "quicklook-csv"   # Quick Look plugin to view csv
# cask "qlimagesize"     # Display image info and preview unsupported formats in QuickLook
# cask "qlprettypatch"   # Quick Look plugin to view patch files / Solved by # syntax-highlight
# cask "suspicious-package" # See security related apk package infos
# cask "apparency"

# Install more cask tools
cask "flux-app" # Monitor color adjustment based on daytime
cask "logseq" # Notes taking, local files
cask "slack" # Team messaging
cask "miro" # Online whiteboard
cask "obsidian" # Notes taking, local files
cask "notion" # Notes taking
cask "webex" # Video communication and virtual meeting platform
cask "zoom" # Video communication and virtual meeting platform
cask "zen" # Privacy focused browser (Mozilla based)
cask "vivaldi" # Customizable browser (Chromium based)
# cask "cheatsheet" # Show shortcuts on screen # DEPRECATED - discontinued upstream
cask "appcleaner" # Uninstall apps and remove all related files 
# cask "1password-cli"
# cask "gemini" #UI duplicate finder 
# cask "spotify"
# cask "spaceid" # Space ID in the menu bar
# cask "dropzone" # Productivity drag/drop / not used recently
# cask "monitorcontrol" ("betterdisplay") # External monitor control
# cask "amazon-photos"
# cask "android-file-transfer"
# cask "tunnelbear" # Command line image manipulation
# cask "protonvpn" # Command line image manipulation
# cask "digikam" # Pictures and album management
# cask "sweet-home32" # Interior design and plan
#cask "hiddenbar"      # Hide icons in topbar -> TODO: muss aus dem Appstore gezogen werden
#cask "google-chrome"
#cask "alt-tab"        # Windows like tab

# Apps from Appstore
mas "HomeAtmo : Der Netatmo client", id: 1359795390  # HomeAtmo Lite
mas "Mini Calendar", id: 1088779979 # Mini Calendar for the top bar
mas "Memory Diag", id: 748212890 # Memory diag widget
mas "Windows App", id: 1295203466 # Remote desktop client for RDP
mas "Color Picker", id: 1545870783 # Apple color picker for menubar
# mas "HomeAtmo Lite : Der Netatmo client", id: 1437630108  # HomeAtmo Lite
# mas "Quick Calendar", id: 1004514425   # QuickCal for widget in notification center
# mas "Brother P-touch Editor", id: 1453365242  # Brothere P Touch
# mas "We Love Lights für Philips Hue", id: 1479422551  # Brothere P Touch
# mas "Hue in the Menu", id: 1534707384  # Hue App or we love lights
# mas "JustStream", id: 1474804779  # Juststream for file to Chromecast streaming
# mas "Meeter for Zoom, Teams & Co", id: 1510445899   # Meeter to join meetings from menubar / Not used
