# Antidote plugin configuration
# This file defines all zsh plugins to be loaded by Antidote
# Plugins are loaded in the order they appear

# Vi mode plugin - comprehensive vim emulation in zsh
# Shortcuts: ESC for normal mode, i/a/o for insert, v for visual, ciw/di"/yy etc.
# Better cursor behavior, surround operations, and closer to native vim
jeffreytse/zsh-vi-mode

# Benchmarking tool for zsh startup performance
# Usage: zsh-bench to measure shell startup time
# romkatv/zsh-bench kind:path

# Abbreviations - expand shortcuts like Fish shell
# Usage: abbr <name>=<expansion>, then type name and space to expand
# Example: abbr gc="git commit" - typing "gc " expands to "git commit "
olets/zsh-abbr kind:defer

# Oh-My-Zsh dependency handler
getantidote/use-omz

# Oh-My-Zsh library - core OMZ functionality
ohmyzsh/ohmyzsh path:lib

# Oh-My-Zsh library for completions setup
mattmc3/ez-compinit

# Additional completion definitions for common commands
# Provides completions for 200+ commands not in zsh core
zsh-users/zsh-completions kind:fpath path:src

# Function utilities - helper functions for managing zsh functions
# and loading from files in a directory
# Provides: fadd, fdel, fpath-add, etc. for function management
# mattmc3/zfunctions

# Git plugin - aliases and functions for git
# Shortcuts: g (git), ga (add), gc (commit), gco (checkout), gp (push), gl (pull), gst (status), etc.
ohmyzsh/ohmyzsh path:plugins/git

# Sudo plugin - press ESC twice to prefix current/previous command with sudo
# Shortcuts: ESC ESC to add sudo
ohmyzsh/ohmyzsh path:plugins/sudo

# FZF plugin - fuzzy finder integration
# Shortcuts: Ctrl+T (files), Ctrl+R (history), Alt+C (cd directories)
ohmyzsh/ohmyzsh path:plugins/fzf

# Note: direnv is initialized manually in shellrc.sh before P10k instant prompt
# to prevent console output warnings

# Virtualenv plugin - Python virtual environment indicator in prompt
# Shows active virtualenv name in prompt
# ohmyzsh/ohmyzsh path:plugins/virtualenv

# Copybuffer - copy command line to clipboard
# Shortcuts: Ctrl+O to copy current command to clipboard
ohmyzsh/ohmyzsh path:plugins/copybuffer

# Extract - universal archive extractor
# Usage: extract <archive> - works with zip, tar, gz, bz2, rar, etc.
ohmyzsh/ohmyzsh path:plugins/extract

# Docker plugin - aliases and completions for docker
# Shortcuts: dps (ps), dex (exec), dlog (logs), drit (run -it), etc.
ohmyzsh/ohmyzsh path:plugins/docker

# Docker Compose plugin - aliases for docker-compose
# Shortcuts: dco (docker-compose), dcup (up), dcdown (down), dclogs (logs), etc.
ohmyzsh/ohmyzsh path:plugins/docker-compose

# Colored man pages - colorizes man pages for better readability
# Automatically applies colors when viewing man pages
ohmyzsh/ohmyzsh path:plugins/colored-man-pages

# Magic Enter - smart enter key behavior
# Empty line + Enter: runs ls and git status in git repos
ohmyzsh/ohmyzsh path:plugins/magic-enter

# Brew plugin (macOS only) - aliases and completions for Homebrew
# Shortcuts: brewp (update+upgrade), bubo (outdated), bubc (cleanup), etc.
ohmyzsh/ohmyzsh path:plugins/brew conditional:is-macos

# macOS plugin (macOS only) - macOS-specific aliases and functions
# Shortcuts: tab (open new Terminal tab), pfd (print Finder directory), etc.
ohmyzsh/ohmyzsh path:plugins/macos conditional:is-macos

# Catppuccin themes for fast-syntax-highlighting
# Clone the repository so themes are available for fast-theme command
# Activate with: fast-theme XDG:catppuccin-mocha (after plugin loads)
catppuccin/zsh-fsh kind:clone

# Community plugins (defer loading for speed where possible)

# FZF-tab - replace zsh default completion with fzf
# Enhances tab completion with fuzzy finder interface
aloxaf/fzf-tab kind:defer

# Zsh-notify (macOS only) - desktop notifications for long-running commands
# Shows notification when command takes longer than 30s
marzocchi/zsh-notify conditional:is-macos

# Essential plugins (load last for priority)

# Autosuggestions - suggests commands as you type based on history
# Shortcuts: → (right arrow) or End to accept suggestion, Ctrl+→ for partial
zsh-users/zsh-autosuggestions

# Fast syntax highlighting - real-time syntax highlighting (faster than zsh-syntax-highlighting)
# Highlights commands, paths, options in real-time with better performance
zdharma-continuum/fast-syntax-highlighting kind:defer

# History substring search - search history with up/down arrows
# Shortcuts: ↑/↓ to search history for commands starting with current input
zsh-users/zsh-history-substring-search

# Powerlevel10k theme (managed by Antidote)
# Fast, customizable prompt with git status, command duration, etc.
# Configure with: p10k configure
romkatv/powerlevel10k

# Catppuccin theme for Powerlevel10k (provides apply_catppuccin function)
# Applies Catppuccin Mocha colors to P10k prompt
tolkonepiu/catppuccin-powerlevel10k-themes

